Tekla Open API Reference for Tekla Structures 2025
Chamfer Constructor (Double, Double, Chamfer.ChamferTypeEnum)
 Instantiates a chamfer with the given values.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Chamfer(
	double X,
	double Y,
	Chamfer.ChamferTypeEnum Type
)
Public Sub New (
	X As Double,
	Y As Double,
	Type As Chamfer.ChamferTypeEnum
)
Parameters
X
Type: System.Double
The X value of the chamfer.
Y
Type: System.Double
The Y value of the chamfer.
Type
Type: Tekla.Structures.Model.Chamfer.ChamferTypeEnum
The basic shape type of the chamfer.
See Also
Reference
Chamfer Class
Chamfer Overload
Tekla.Structures.Model Namespace